Tekla.Structures.Analysis.AnalysisRigidDiaphragm
The AnalysisRigidDiaphragm class contains information related to analysis rigid diaphragms.

Tekla.Structures.Analysis.AnalysisRigidDiaphragm._ExtremaMinimum
The minimum of the extrema.

Tekla.Structures.Analysis.AnalysisRigidDiaphragm._ExtremaMaximum
The maximum of the extrema.

Tekla.Structures.Analysis.AnalysisRigidDiaphragm._MasterNodeID
The identifier of the master node.

Tekla.Structures.Analysis.AnalysisRigidDiaphragm._PartIDs
The part identifier.

Tekla.Structures.Analysis.AnalysisRigidDiaphragm._SlaveNodeIDs
The slave node identifier.

Tekla.Structures.Analysis.AnalysisRigidDiaphragm.ExtremaMinimum
The minimum of the extrema (in the global coordinate system).

Tekla.Structures.Analysis.AnalysisRigidDiaphragm.ExtremaMaximum
The maximum of the extrema (in the global coordinate system).

Tekla.Structures.Analysis.AnalysisRigidDiaphragm.MasterNodeID
The identifier of the master node.

Tekla.Structures.Analysis.AnalysisRigidDiaphragm.PartIDs
The part identifier.

Tekla.Structures.Analysis.AnalysisRigidDiaphragm.SlaveNodeIDs
The slave node identifier.

Tekla.Structures.Analysis.AnalysisRigidDiaphragm.Select
Selects an analysis rigid diaphragm.
The ID has to be set.

Tekla.Structures.Analysis.AnalysisRigidDiaphragm.SelectInstance
DO NOT USE! For internal usage only!